{
  "basics": {
    "name": "Stephan Erasmus",
    "label": "Developer, Researcher",
    "picture": "https://Stephan-e.github.io/images/me.jpg",
    "email": "astephanerasmus@gmail.com",
    "phone": "+866908584366",
    "website": "https://Stephan-e.github.io",
    "summary": "I have over three years of work experience as an back-end software developer with critical skills in REST API development, software infrastructure and app development. With a background in Electrical engineering and mathematical modelling research I am able to apply myself in technical roles. I am passionate about solving problems and improving processes. I have worked in start-up environments and understand how to build and scale digital processes. I am a team player and I have excellent interpersonal communication skills as I have part time teaching experience as well as hosted technical workshops and hackathons..",
    "location": {
      "address": "",
      "postalCode": "111",
      "city": "Taipei",
      "countryCode": "Taiwan",
      "region": "Taipei City"
    },
    "profiles": [
      {
        "network": "github",
        "username": "Stephan-e",
        "url": "http://github.com/Stephan-e"
      },
      {
        "network": "linkedin",
        "username": "Stephann Erasmus",
        "url": "https://www.linkedin.com/in/stephan-erasmus-ab28169b/"
      }
    ]
  },
  "interests": [
    {
      "name": "Internet of Things",
      "keywords": [
        "Arduino",
        "Raspberry Pi"
      ]
    },
    {
      "name": "Web Development",
      "keywords": [
        "Python", 
        "Django",
        "API", 
        "Apps"
      ]
    },
    {
      "name": "Renewable Energy",
      "keywords": [
        "Electrical Machines",
        "Mechanical Design",
        "Wind Turbines", 
        "Energy Efficiency",
        "energy Storage"
      ]
    },
    {
      "name": "Research",
      "keywords": [
        "Hypothesis testing",
        "Experimentation",
        "Report Writing", 
        "Prototyping"
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "level": "",
      "keywords": [
        "Python",
        "Django",
        "C",
        "C++",
        "Java",
        "Javascript",
        "Assembly",
        "HTML",
        "CSS",
        "React",
        "Matlab",
        "Scipy",
        "Pandas",
        "LaTeX",
        "SQL",
        "FPGA",
        "VHDL"

      ]
    },
    {
      "name": "Toolsets/OS",
      "level": "",
      "keywords": [
        "MacOS",
        "Ubuntu",
        "Git/GitHub",
        "Postman",
        "Docker",
        "Linux",
        "Google Cloud",
        "Firebase",
        "VSCode"
      ]
    }
  ],
  "education": [
    {
      "institution": "Stellenbosch University, South Africa",
      "area": "MEng Electrical Engineering",
      "studyType": "MSc",
      "startDate": "2016-01-01",
      "endDate": "2017-03-01",
      "gpa": "Cum Laude",
      "courses": [
      ]
    },
    {
      "institution": "Stellenbosch University, South Africa",
      "area": "BEng Electrical Engineering (Energy)",
      "studyType": "B.Enng",
      "startDate": "2010-01-01",
      "endDate": "2015-12-01",
      "gpa": "",
      "courses": ["Robotics", "Systems + Signals", "Electrical Drive systems", "Electronics", "Renewable Energy", "Power Electronics"
      ]
    }
  ],
  "work": [
    {
      "company": "Skyrock Projects",
      "position": "Technical Lead / Curriculum Developer",
      "website": "www.skyrockprojects.com",
      "startDate": "2019-01-01",
      "endDate": "2020-03-01",
      "summary": "Lead of all technical development of curriculum and business.",
      "highlights": [
      "Construction of a web app built using Python Django for student management and creative software tools for students.", 
      "Design and management of coding curriculum and projects for a project based learning school." 
      ]
    },
    {
      "company": "Rehive",
      "position": "Software Engineer",
      "website": "www.rehive.com",
      "startDate": "2018-01-01",
      "endDate": "2019-01-01",
      "summary": "Backend development of Blockchain Apps",
      "highlights": [
        "Built various Python Django back-end systems for integration with Blockchain and Financial technologies."
      ]
    },
    {
      "company": "RSAWEB",
      "position": "Software Engineer",
      "website": "www.rsaweb.co.za",
      "startDate": "2017-08-01",
      "endDate": "2018-01-01",
      "summary": "Full stack development for payment integrations",
      "highlights": [
        "Software integration of a payment system using Docker, PHP, Python."
      ]
    },
    {
      "company": "Stellenbosch University",
      "position": "Project Engineer",
      "website": "ee.sun.ac.za",
      "startDate": "2015-06-01",
      "endDate": "2017-06-01",
      "summary": "Research and Development",
      "highlights": [
        "Research on renewable wind energy. Construction of 2.2 kW wind turbine. ",
        "The construction of a FPGA measurement system for the control of electrical machines. PCB layout and design boards. ",
        "Migration of FPGA system to ARM based system. General laboratory administration."
      ]
    },
    {
      "company": "Stellenbosch University",
      "position": "Researcher",
      "website": "ee.sun.ac.za",
      "startDate": "2014-06-01",
      "endDate": "2017-06-01",
      "summary": "Research and Development",
      "highlights": [
        "Research on a magnetic coupler and improved design using multi objective design modelling and tests.", 
        "Model validated with built prototype.",
        "Published research."
      ]
    }
  ],
  
  "publications": [
    {
      "author": "A.S. Erasmus and M.J. Kamper",
      "name": "Analysis and design optimisation of a double pm-rotor radial-flux eddy current coupler",
      "publisher": "IEEE energy Conversion Congres and Expo",
      "summary": "In this study a semi-analytical calculation method for obtaining 3D solutions for the torque of radial flux permanent magnet eddy current couplers is presented. In this way the use of computationally expensive transient 3D finite element solutions is avoided, which is very important when it comes to the design optimisation of these machines. The proposed analytical method takes the effect of flux density harmonics into account. The 3D end-effects are taken into account by using Russell's coefficient. The accuracy of the proposed semi-analytical calculation method is evaluated against extreme variation of machine dimensions. It is shown that this fast calculation method can be used with great accuracy in the design optimisation of these couplers."
    },
    {
      "author": "A.S. Erasmus and M.J. Kamper",
      "name": "Computationally efficient analysis of double PM-rotor radial-flux eddy current couplers",
      "publisher": "IEEE Transactions on Industry Applications",
      "summary": "In this study, a semianalytical calculation method for obtaining 3-D solutions for the torque of radial-flux permanent magnet eddy current couplers is presented. In this way, the use of computationally expensive transient 3-D finite element solutions is avoided, which is very important when it comes to the design optimization of these machines. The proposed analytical method takes the effect of flux density harmonics into account. The 3-D end-effects are taken into account by using Russell's coefficient. The accuracy of the proposed semianalytical calculation method is evaluated against extreme variation of machine dimensions. The Russell end-effect factor is evaluated and found to be inaccurate for axially short and radially large couplers. A prototype coupler with different conductors was tested to validate the proposed semianalytical torque calculation method."
    },
    {
      "author": "A.S. Erasmus and M.J. Kamper",
      "name": "Multi-objective design optimisation and pareto front visualisation of radial-flux eddy current coupling for a wind generator drivetrain",
      "publisher": "2016 IEEE Energy Conversion Congress and Exposition (ECCE)",
      "summary": "In this paper the design optimisation of a 2.2 kW, double rotor, radial axis eddy current coupling operating at 97 % efficiency, designed for a wind turbine drive train application is described. A computationally efficient finite element analysis in conjunction with gradient (MMFD) and population (NSGA) based design optimisation algorithms is used in order to obtain an optimal coupling design. The two optimisation algorithms are evaluated in terms of speed and accuracy. The comparison between copper and aluminium conductor materials revealed that the aluminium is the preferred material in terms of mass and cost. A gradient-based analysis method with regard to the input parameters of the genetic optimisation algorithm's pareto curve is proposed."
    }
  ],
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}